[
  {
    "id": 1,
    "name": "Clothes store",
    "disc": "This was my inaugural project, developed solely with HTML and CSS. After acquiring knowledge in JavaScript, I optimized this project, marking it as my first-ever optimized endeavor",
    "imgs": [1, 2],
    "link": "https://e-commersclotherstore.netlify.app/"
  },
  {
    "id": 2,
    "name": "Simple Form Log-in",
    "disc": "Simple user authentication with the Simple Form Log-in project. Provide users with a clean and straightforward login experience using HTML, CSS, and JavaScript.",
    "imgs": [3],
    "link": "https://simpleloginplatform.netlify.app/"
  },
  {
    "id": 3,
    "name": "Multi-step form",
    "disc": "Elevate the form-filling experience with the Multi-step Form project, now powered by Vue.js. Break down complex forms into user-friendly steps for improved engagement.",
    "imgs": [4, 5, 6, 7, 8, 9, 10, 11],
    "link": "https://mutistep-form.netlify.app/"
  },
  {
    "id": 4,
    "name": "Calculator",
    "disc": "Perform calculations effortlessly with the Calculator project. This application offers a user-friendly interface for all your mathematical needs, built using HTML, CSS, and JavaScript.",
    "imgs": [12, 13, 14, 15, 16],
    "link": "https://abdelrahmanscalculator.netlify.app/"
  },
  {
    "id": 5,
    "name": "Todo list",
    "disc": "Boost productivity with the Todo List project. Manage your tasks efficiently with a responsive and intuitive task management system, crafted with HTML, CSS, and JavaScript.",
    "imgs": [17, 18, 19, 20, 21, 22],
    "link": "https://abdelrahamnstodolist.netlify.app/"
  },
  {
    "id": 6,
    "name": "Rock-paper-scissors",
    "disc": "Dive into the timeless game of rock-paper-scissors with our interactive project, crafted with Bootstrap and powered by HTML5, CSS3, and JavaScript ES6 Enjoy hours of strategic fun with an intuitive interface. Challenge friends, customize gameplay, and explore colorful design. Educational and entertaining, it offers a portable gaming experience perfect for honing decision-making skills anywhere, anytime.",
    "imgs": [23, 24, 25],
    "link": "https://my-scissors-paper-rock-game.netlify.app/"
  },
  {
    "id": 7,
    "name": "Advice generator app",
    "disc": "Utilizing HTML, CSS, JS, API, and Bootstrap, I crafted an engaging advice generator project. Seamlessly combining design and functionality, users receive personalized advice, enhancing their decision-making process with ease and style.",
    "imgs": [26, 27],
    "link": "https://abdelrahmans-advice-generator.netlify.app/"
  },
  {
    "id": 8,
    "name": "Rest countries",
    "disc": "Rest Countries is a web project leveraging HTML5, CSS3, ES6, and Bootstrap to showcase detailed information about 250 countries sourced from a JSON file. Users can explore countries' flags, populations, capitals, and regions in a user-friendly interface.",
    "imgs": [28, 29, 30, 31],
    "link": "https://abdelrahmans-rest-countries.netlify.app/"
  }
]
